/*
1. Одна з колонок таблиці повинна містити значення, що повторюються, для
виділення підгруп, інша колонка повинна мати числові значення. Створіть запит, який
отримає усереднені (avg) значення другої колонки кожного рядка в кожній підгрупі.
*/
SELECT
    DISTINCT CLIENTID,
    AVG(BILLAMOUNT) OVER (
    PARTITION BY CLIENTID) AS AVERAGE
FROM
    BILL;
/*
CLIENTID      AVERAGE
---------- ----------
1               274.5
2                 299
3                 349
4                 199
5                 199
6                 199
7                 199
8                 250

8 rows selected.
*/


/*
2. Одна з колонок таблиці повинна містити значення, що повторюються, для
виділення підгруп, інша колонка повинна мати числові значення. Створіть запит, який
отримає накопичувальні підсумки другої колонки.
*/
SELECT 
    CLIENTID,
    SUM(BILLAMOUNT) OVER (
        ORDER BY CLIENTID
    ) AS PAYED
FROM BILL; 
/*
CLIENTID        PAYED
---------- ----------
1                 549
1                 549
2                1147
2                1147
3                1845
3                1845
4                2243
4                2243
5                2840
5                2840
5                2840
6                3039
7                4233
7                4233
7                4233
7                4233
7                4233
7                4233
8                4483

19 rows selected.
*/


/*
3. Виконайте попереднє завдання, отримавши накопичувальні підсумки в кожній
підгрупі окремо.
*/  
SELECT 
    CLIENTID,
    SUM(BILLAMOUNT) OVER (
        PARTITION BY CLIENTID
        ORDER BY BILLDATE
    ) AS PAYED
FROM BILL; 
/*
CLIENTID        PAYED
---------- ----------
1                 250
1                 549
2                 299
2                 598
3                 349
3                 698
4                 199
4                 398
5                 398
5                 398
5                 597
6                 199
7                 199
7                 398
7                 796
7                 796
7                 995
7                1194
8                 250

19 rows selected.
*/

