/*
1. Одна з колонок таблиці повинна містити значення, що повторюються, для
виділення підгруп, інша колонка повинна мати числові значення. Створіть запит, який
отримає усереднені (avg) значення другої колонки кожного рядка в кожній підгрупі.
*/
SELECT clientid, AVG(billamount) FROM bill GROUP BY clientid;
/*
CLIENTID   AVG(BILLAMOUNT)
---------- ---------------
1                    274.5
2                      299
3                      349
4                      199
5                      199
6                      199
7                      199
*/


/*
2. Одна з колонок таблиці повинна містити значення, що повторюються, для
виділення підгруп, інша колонка повинна мати числові значення. Створіть запит, який
отримає накопичувальні підсумки другої колонки.
*/
select clientid, sum(billamount) over (partition by billamount) as sumAmount from bill;
/*
CLIENTID    SUMAMOUNT
---------- ----------
6                1194
4                1194
5                1194
7                1194
5                1194
4                1194
1                 250
1                 897
2                 897
2                 897
3                 698
3                 698
*/


/*
3. Виконайте попереднє завдання, отримавши накопичувальні підсумки в кожній
підгрупі окремо.
*/
SELECT clientid, SUM(billamount) FROM bill GROUP BY clientid;
/*
CLIENTID   SUM(BILLAMOUNT)
---------- ---------------
1                      549
2                      598
3                      698
4                      398
5                      398
6                      199
7                      199
*/

