-- 2.1 Для однієї з таблиць створити команду отримання значень всіх колонок (явно
-- перерахувати) у всіх рядках.
SELECT 
    clientID, 
    clientName, 
    birthday,
    managerId
FROM Client; 

/*
CLIENTID   CLIENTNAME                               BIRTHDAY   MANAGERID
---------- ---------------------------------------- ---------- ----------
1          name 1                                   01/01/2001 1
2          name 2                                   02/02/2002 2
*/

-- 2.2 Для однієї з таблиць створити команду отримання цілого числа колонки з
-- використанням будь-якої арифметичної операції. При виведенні на екран визначити для
-- зазначеної колонки нову назву псевдоніма.
SELECT 
    pricePerMonth as Amount
FROM InternetPackage
WHERE pricePerMonth > 200;
/*
    AMOUNT
----------
       299
       399
       499
       599
*/

-- 2.3 Для однієї з таблиць, що містить колонку зовнішнього ключа створити команду
-- отримання значення колонки без дублювання значень.
SELECT DISTINCT managerId as MGID
    FROM CLient; 
-- MGID
-- ----------
-- 1
-- 2

-- 2.4 Для однієї з таблиць створити команду отримання результату конкатенації значень будь-
-- яких двох колонок. При виведенні на початок рядка виведення додати літерал «UNION=».
SELECT managerId FROM Client
UNION 
SELECT managerId FROM Manager; 
/*
MANAGERID
----------
1
2
3
4
*/

-- 2.5 Модернізувати рішення завдання 2.2, отримавши в порядку зростання значення
-- псевдоніму.
SELECT 
    pricePerMonth as Amount
FROM InternetPackage
WHERE pricePerMonth > 200 
ORDER BY Amount ASC;
/*
    AMOUNT
----------
       299
       399
       499
       599
*/

-- 2.6 Для однієї з таблиць створити команду отримання значення двох колонок, значення
-- яких відсортовані в порядку зростання (для першої колонки) та в порядку зменшення (друга
-- колонка).
SELECT 
    billamount as Amount, billdate as b_date
FROM Bill
ORDER BY Amount DESC , b_date ASC; 
/*
    AMOUNT B_DATE
---------- ----------
       299 02/11/2022
       199 02/10/2022
*/

