/*
1. Створіть запит, який отримає рядки таблиці з урахуванням присутності в раніше
вказаній колонці поєднання будь-яких двох підряд розташованих цифр, або трьох підряд
розташованих букв.
*/
SELECT * FROM CLIENT 
WHERE regexp_like(CLIENTNAME, '[0-9]{2}|[a-zA-Z]{3}');
/*
CLIENTID   CLIENTNAME                               MANAGERID  BIRTHDAY   CLIENTAGE
---------- ---------------------------------------- ---------- --------- ----------
1          Name 1                                   1          01-JAN-01
2          Name 2                                   2          02-FEB-02
6          Name3                                    4          10-OCT-10
4          Liam Nisson                              6          01-JAN-01
5          Liam Nisson                              7          01-JAN-01
*/

/*
2. Одна з колонок таблиць повинна містити строкове значення з двома однаковими
буквами, що повторюються підряд. Створіть запит, який отримає рядки таблиці з таким значенням
колонки.
*/
SELECT * FROM CLIENT 
WHERE regexp_like(CLIENTNAME, '([[:alpha:]])\1');
/*
CLIENTID   CLIENTNAME                               MANAGERID  BIRTHDAY   CLIENTAGE
---------- ---------------------------------------- ---------- --------- ----------
4          Liam Nisson                              6          01-JAN-01
5          Liam Nisson                              7          01-JAN-01
*/

/*
3. Одна з колонок таблиць повинна містити строкове значення з двома однаковими
словами, що повторюються підряд. Створіть запит, який отримає рядки таблиці з таким значенням
колонки.
*/
SELECT * FROM CLIENT 
WHERE regexp_like(CLIENTNAME, '([[:alpha:]]+)([[:space:]]+)\1');
/*
CLIENTID   CLIENTNAME                               MANAGERID  BIRTHDAY    CLIENTAGE
---------- ---------------------------------------- ---------- ---------- ----------
55         Snow Snow Ho                             8          01/01/1978         45
*/

/*
4. Одна з колонок таблиць повинна містити строкове значення з номером мобільного
телефону у форматі +XX(XXX)XXX-XX-XX, де X – цифра. Створіть запит, який отримає рядки
таблиці з таким значенням колонки.
*/
SELECT * FROM CLIENT 
WHERE regexp_like(PHONE, '(\+[0-9]{2}\([0-9]{3}\)[0-9]{3}\-[0-9]{2}\-[0-9]{2})');
/*
CLIENTID   CLIENTNAME                               MANAGERID  BIRTHDAY    CLIENTAGE PHONE
---------- ---------------------------------------- ---------- ---------- ---------- --------------------
555        Snow Snow Ho                             8          01/01/1978         45 +38(066)666-66-66
*/

/*
5. Одна з колонок таблиць має містити строкове значення з електронною поштовою
адресою у форматі EEE@EEE.EEE.UA, де E – будь-яка латинська буква. Створіть запит, який
отримає рядки таблиці з таким значенням колонки.
*/ 
--  testUsetLogin@eml.com.ua
SELECT * FROM CLIENT 
WHERE regexp_like(EMAIL, '(^.*\@.{3}\..{3}\..{2})');
/*
CLIENTID   CLIENTNAME                               MANAGERID  BIRTHDAY    CLIENTAGE PHONE                EMAIL
---------- ---------------------------------------- ---------- ---------- ---------- -------------------- ----------------------------------------
555        Snow Snow Ho                             8          01/01/1978         45 +38(066)666-66-66    testUsetLogin@eml.com.ua
*/